import numpy as np

# Проверка ответа из учебника (там опечатка)
A = np.array([[ 1, -1,  1, -2],
              [-9, -1,  1,  8],
              [-7,  0,  8, -6],
              [ 3, -5,  1, -6]], dtype=float)
x_book = np.array([-4, 0, -8, -4], dtype=float)
x_my = np.array([-4.00000000e+00, 6.66133815e-16, -8.00000000e+00, 4.00000000e+00])
print("Book answer: ", A @ x_book, "  => не сходится с исходным b")
print("My answer:   ", A @ x_my, "  => сходится с исходным b")

# ожидали b = [-20, 60, -60, -44], получили b = [ -4, -4, -12, 4] по x_book

# Ответ в учебнике: [-4, 0, -8, -4]
# Мой ответ (приближенный): [-4, 0, -8, 4]
# Опечатка: Разница в знаке последнего числа